In [1]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame(np.random.randint(0,100,(5,2)),columns=['A','B'])
df2 = pd.DataFrame(np.random.random((5,2)),columns=['A','B'])
df3 = pd.DataFrame(np.random.random((5,2)),columns=['A','B'])
df1

    A   B
0  69  53
1   2  19
2  16  22
3   8  98
4  75  65

In [2]:
pd.concat([df1,df2])

           A          B
0  69.000000  53.000000
1   2.000000  19.000000
2  16.000000  22.000000
3   8.000000  98.000000
4  75.000000  65.000000
0   0.731558   0.563341
1   0.075072   0.029638
2   0.076023   0.489712
3   0.263292   0.952214
4   0.490074   0.664311

In [3]:
pd.concat([df1,df2],ignore_index=True)

           A          B
0  69.000000  53.000000
1   2.000000  19.000000
2  16.000000  22.000000
3   8.000000  98.000000
4  75.000000  65.000000
5   0.731558   0.563341
6   0.075072   0.029638
7   0.076023   0.489712
8   0.263292   0.952214
9   0.490074   0.664311

In [4]:
pd.concat([df1,df2],axis=1)

    A   B         A         B
0  69  53  0.731558  0.563341
1   2  19  0.075072  0.029638
2  16  22  0.076023  0.489712
3   8  98  0.263292  0.952214
4  75  65  0.490074  0.664311

In [5]:
d = {"Col1" : ['P','P','Q'],"Col2" : ['x','y','z'],"Col3" : ['A','B','C']}
df = pd.DataFrame(d)
df

  Col1 Col2 Col3
0    P    x    A
1    P    y    B
2    Q    z    C

In [6]:
pd.Series(df['Col1']).value_counts()

Col1
P    2
Q    1
Name: count, dtype: int64

In [7]:
d = {'Name':["Sun","Mon","Tue"],"Marks":[56,32,54],"Class":[1,2,3]}
df = pd.DataFrame(d,index=['a','b','c'])
df

  Name  Marks  Class
a  Sun     56      1
b  Mon     32      2
c  Tue     54      3

In [8]:
df.columns

Index(['Name', 'Marks', 'Class'], dtype='object')

In [9]:
list(df.columns)

['Name', 'Marks', 'Class']

In [10]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [11]:
list(df.index)

['a', 'b', 'c']

In [12]:
df.reindex(['b','c','d']) # here we can change the order of indexs we can't add a new index name here

  Name  Marks  Class
b  Mon   32.0    2.0
c  Tue   54.0    3.0
d  NaN    NaN    NaN

In [13]:
df.dtypes

Name     object
Marks     int64
Class     int64
dtype: object

In [14]:
df.reindex(columns=["Name","Class","Marks"])

  Name  Class  Marks
a  Sun      1     56
b  Mon      2     32
c  Tue      3     54

In [15]:

df.columns = ["ST_Name","ST_Class","ST_Marks"]
df

  ST_Name  ST_Class  ST_Marks
a     Sun        56         1
b     Mon        32         2
c     Tue        54         3

In [16]:
df.index=[2,3,4]
df

  ST_Name  ST_Class  ST_Marks
2     Sun        56         1
3     Mon        32         2
4     Tue        54         3

In [36]:
df.drop(["ST_Name"],axis=1) # drop a coloumn

   ST_Class  ST_Marks
2        56         1
3        32         2
4        54         3

In [40]:
df.drop(4)#drop a row

  ST_Name  ST_Class  ST_Marks
2     Sun        56         1
3     Mon        32         2